In [1]:
import pandas as pd
import numpy as np

# **Q1:-** 
### **Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.**

In [2]:
data=np.array([4,8,15,16,23,42])
ser=pd.Series(data,index=[1,2,3,4,5,6])
ser

1     4
2     8
3    15
4    16
5    23
6    42
dtype: int32

# **Q2:-**
### **Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.**

In [3]:
num=[10,20,30,40,50,60,70,80,90,100]
df=pd.Series(num)
print(df)
(type(df))

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

pandas.core.series.Series

# **Q3:-**
### **Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.**

In [4]:
info={"Name":["Alice","Bob","Claire"]
,"Age":[25,30,27],
"Gender":["Female","Male","Female"]
}

In [5]:
df=pd.DataFrame(info)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# **Q4:-**
### **What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.**

##### As noted in the table, a Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column. The main distinction between the two is this. For a single-column DataFrame, an index can be optional, but a Series has to have an index defined.

In [6]:
df2=pd.read_csv("D:\PW-DATA SCIENCE\Week-08\Raw_Housing_Prices.csv")
df2.head(2)

,ID,Date House was Sold,Sale Price,No of Bedrooms,No of Bathrooms,Flat Area (in Sqft),Lot Area (in Sqft),No of Floors,Waterfront View,No of Times Visited,...,Overall Grade,Area of the House from Basement (in Sqft),Basement Area (in Sqft),Age of House (in Years),Renovated Year,Zipcode,Latitude,Longitude,Living Area after Renovation (in Sqft),Lot Area after Renovation (in Sqft)
0,7129300520,14 October 2017,221900.0,3,1.00,1180.0,5650.0,1.0,No,NaN,...,7,1180.0,0,63,0,98178.0,47.5112,-122.257,1340.0,5650
1,6414100192,14 December 2017,538000.0,3,2.25,2570.0,7242.0,2.0,No,NaN,...,7,2170.0,400,67,1991,98125.0,47.7210,-122.319,1690.0,7639

### **Dataframe:-**

In [7]:
type(df2[["Date House was Sold"]])

pandas.core.frame.DataFrame

### **series:- It store the data in list form**

In [8]:
type(df2["Date House was Sold"])

pandas.core.series.Series

# **Q5:-**
### **What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?**

In [9]:
info={"Name":["Abhishek","Ankit","Vidhi","Nidhi","Shivang","Parth","Swastik","Nikki","Ishu","Khusi"],
"Age":[21,24,23,27,19,16,15,26,13,20],
"Address":["Bhadohi","Bhadohi","Mumbai","Mumbai","Dehradon","Dehradon","varanshi","Mumbai East","Jaunpur","Mumbai"],  
"Money":[12000,23000,12000,23000,21300,43000,23000,54000,65000,45000],
"Gender":["male","male","female","female","male","male","male","female","male","female"],
"Post":["Data Scientist","Data Scientist","Bank Manager","Bank Manager","Student","Student","Student","Teacher","Student","Student"]
}

In [10]:
df=pd.DataFrame(info)
df

       Name  Age      Address  Money  Gender            Post
0  Abhishek   21      Bhadohi  12000    male  Data Scientist
1     Ankit   24      Bhadohi  23000    male  Data Scientist
2     Vidhi   23       Mumbai  12000  female    Bank Manager
3     Nidhi   27       Mumbai  23000  female    Bank Manager
4   Shivang   19     Dehradon  21300    male         Student
5     Parth   16     Dehradon  43000    male         Student
6   Swastik   15     varanshi  23000    male         Student
7     Nikki   26  Mumbai East  54000  female         Teacher
8      Ishu   13      Jaunpur  65000    male         Student
9     Khusi   20       Mumbai  45000  female         Student

In [11]:
df.head(3)

       Name  Age  Address  Money  Gender            Post
0  Abhishek   21  Bhadohi  12000    male  Data Scientist
1     Ankit   24  Bhadohi  23000    male  Data Scientist
2     Vidhi   23   Mumbai  12000  female    Bank Manager

In [12]:
df.tail(3)

    Name  Age      Address  Money  Gender     Post
7  Nikki   26  Mumbai East  54000  female  Teacher
8   Ishu   13      Jaunpur  65000    male  Student
9  Khusi   20       Mumbai  45000  female  Student

In [13]:
df["Name"]

0    Abhishek
1       Ankit
2       Vidhi
3       Nidhi
4     Shivang
5       Parth
6     Swastik
7       Nikki
8        Ishu
9       Khusi
Name: Name, dtype: object

In [14]:
df[["Name","Post"]]

       Name            Post
0  Abhishek  Data Scientist
1     Ankit  Data Scientist
2     Vidhi    Bank Manager
3     Nidhi    Bank Manager
4   Shivang         Student
5     Parth         Student
6   Swastik         Student
7     Nikki         Teacher
8      Ishu         Student
9     Khusi         Student

# **Q6:-**
### **Which of the following is mutable in nature Series, DataFrame, Panel?**

## **Ans:-**

### **All Pandas data structures are value mutable (can be changed) and except Series all are size mutable.**

# **Q7:-**
### **Create a DataFrame using multiple Series. Explain with an example.**

In [15]:
df2=pd.read_csv("D:\PW-DATA SCIENCE\Week-08\Raw_Housing_Prices.csv")
df2.head(5)

,ID,Date House was Sold,Sale Price,No of Bedrooms,No of Bathrooms,Flat Area (in Sqft),Lot Area (in Sqft),No of Floors,Waterfront View,No of Times Visited,...,Overall Grade,Area of the House from Basement (in Sqft),Basement Area (in Sqft),Age of House (in Years),Renovated Year,Zipcode,Latitude,Longitude,Living Area after Renovation (in Sqft),Lot Area after Renovation (in Sqft)
0,7129300520,14 October 2017,221900.0,3,1.00,1180.0,5650.0,1.0,No,NaN,...,7,1180.0,0,63,0,98178.0,47.5112,-122.257,1340.0,5650
1,6414100192,14 December 2017,538000.0,3,2.25,2570.0,7242.0,2.0,No,NaN,...,7,2170.0,400,67,1991,98125.0,47.7210,-122.319,1690.0,7639
2,5631500400,15 February 2016,180000.0,2,1.00,770.0,10000.0,1.0,No,NaN,...,6,770.0,0,85,0,98028.0,47.7379,-122.233,2720.0,8062
3,2487200875,14 December 2017,604000.0,4,3.00,1960.0,5000.0,1.0,No,NaN,...,7,1050.0,910,53,0,98136.0,47.5208,-122.393,1360.0,5000
4,1954400510,15 February 2016,510000.0,3,2.00,1680.0,8080.0,1.0,No,NaN,...,8,1680.0,0,31,0,98074.0,47.6168,-122.045,1800.0,7503

In [16]:
df2["ID"]

0        7129300520
1        6414100192
2        5631500400
3        2487200875
4        1954400510
            ...
21608     263000018
21609    6600060120
21610    1523300141
21611     291310100
21612    1523300157
Name: ID, Length: 21613, dtype: int64

In [17]:
df2["Sale Price"]

0        221900.0
1        538000.0
2        180000.0
3        604000.0
4        510000.0
           ...
21608    360000.0
21609    400000.0
21610    402101.0
21611    400000.0
21612    325000.0
Name: Sale Price, Length: 21613, dtype: float64

In [18]:
df2["Date House was Sold"]

0         14 October 2017
1        14 December 2017
2        15 February 2016
3        14 December 2017
4        15 February 2016
               ...
21608         14 May 2017
21609    15 February 2016
21610        14 June 2017
21611     15 January 2016
21612     14 October 2017
Name: Date House was Sold, Length: 21613, dtype: object

In [19]:
df2[["ID","Sale Price","Date House was Sold"]]

               ID  Sale Price Date House was Sold
0      7129300520    221900.0     14 October 2017
1      6414100192    538000.0    14 December 2017
2      5631500400    180000.0    15 February 2016
3      2487200875    604000.0    14 December 2017
4      1954400510    510000.0    15 February 2016
...           ...         ...                 ...
21608   263000018    360000.0         14 May 2017
21609  6600060120    400000.0    15 February 2016
21610  1523300141    402101.0        14 June 2017
21611   291310100    400000.0     15 January 2016
21612  1523300157    325000.0     14 October 2017

[21613 rows x 3 columns]